ATsupportum/src/Catalogs/Серверы_ат/Серверы_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Серверы_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Лезвие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МатеринскаяПлата</name>
    <type>
      <types>CatalogRef.МатеринскиеПлаты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>HyperThreading</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Виртуализация</name>
    <type>
      <types>CatalogRef.ВидыВиртуализацииСерверов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Hostname</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шлюз</name>
    <type>
      <types>CatalogRef.ВыделенныеIP_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентВладелец</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Чужой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойIP</name>
    <type>
      <types>CatalogRef.ВыделенныеIP_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляНас</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CPU_ат</name>
    <attributes>
      <name>Процессор</name>
      <type>
        <types>CatalogRef.CPU_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RAM</name>
    <attributes>
      <name>МодулиПамяти_ат</name>
      <type>
        <types>CatalogRef.МодулиПамяти_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>HDD_ат</name>
    <attributes>
      <name>HDD_ат</name>
      <type>
        <types>CatalogRef.HDD_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Raid</name>
      <type>
        <types>EnumRef.ТипыRAID_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СХД_ат</name>
    <attributes>
      <name>СХД_ат</name>
      <type>
        <types>CatalogRef.СХД_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>IPv4</name>
    <attributes>
      <name>IP</name>
      <type>
        <types>CatalogRef.ВыделенныеIP_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DNS_servers</name>
    <attributes>
      <name>DNS</name>
      <type>
        <types>CatalogRef.ВыделенныеIP_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Wins_servers</name>
    <attributes>
      <name>WINS</name>
      <type>
        <types>CatalogRef.ВыделенныеIP_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DNS_суффиксы</name>
    <attributes>
      <name>DNS_суффикс</name>
      <type>
        <types>CatalogRef.DNS_суффиксы_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Interfaces_</name>
    <attributes>
      <name>Interface</name>
      <type>
        <types>CatalogRef.СетевыеИнтерфейсы_ат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/InformationRegisters/СписокУведомляемыхОСтатусахСерверов_ат/СписокУведомляемыхОСтатусахСерверов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СписокУведомляемыхОСтатусахСерверов_ат</name>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Серверы_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>EnumRef.ПараметрыСерверов_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/Enums/ПараметрыСерверов_ат/ПараметрыСерверов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПараметрыСерверов_ат</name>
  <enumValues>
    <name>КритичнаяЗагрузкаПроцессора</name>
  </enumValues>
  <enumValues>
    <name>ПороговаяЗагрузкаПроцессора</name>
  </enumValues>
  <enumValues>
    <name>ПороговаяЗагрузкаПамяти</name>
  </enumValues>
  <enumValues>
    <name>ПороговаяЗагрузкаДисковойПодсистемы</name>
  </enumValues>
  <enumValues>
    <name>КритичнаяЗагрузкаПамяти</name>
  </enumValues>
  <enumValues>
    <name>КритичнаяЗагрузкаДисковойПодсистемы</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийОКретичнойЗагрузкеПроцессора</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийОКретичнойЗагрузкеПамяти</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийОКретичнойЗагрузкеДисковойПодсистемы</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийОПредельнойЗагрузкеПроцессора</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийОПредельнойЗагрузкеПамяти</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийОПредельнойЗагрузкеДиска</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийОбОтсутствииСвязиССервером</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьОбОтсутствииСвязи</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьОПредельнойЗагрузкеПроцессора</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьОПредельнойЗагрузкеПамяти</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьОПороговомЗаполненииДисковойПодсистемы</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьОКритическомЗаполненииДискокойПодсистемы</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьОКритическойЗагрузкеПроцессора</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьОКритическойЗагрузкеПамяти</name>
  </enumValues>
  <enumValues>
    <name>ПериодичностьУведомленийГлобальная</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Catalogs/Серверы_ат/Forms/ФормаНастрокиУведомляемых/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сервер") И ЗначениеЗаполнено(Параметры.Сервер) Тогда
		
		Сервер = Параметры.Сервер;
		Элементы.Сервер.Доступность = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("Пользователь") И ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		
		Пользователь = Параметры.Пользователь;
		Элементы.Пользователь.Доступность = Ложь;
	КонецЕсли;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокУведомляемыхОСтатусахСерверов_ат.Сервер,
		|	СписокУведомляемыхОСтатусахСерверов_ат.Пользователь,
		|	СписокУведомляемыхОСтатусахСерверов_ат.Параметр
		|ИЗ
		|	РегистрСведений.СписокУведомляемыхОСтатусахСерверов_ат КАК СписокУведомляемыхОСтатусахСерверов_ат
		|ГДЕ
		|	СписокУведомляемыхОСтатусахСерверов_ат.Пользователь = &Пользователь
		|	И СписокУведомляемыхОСтатусахСерверов_ат.Сервер = &Сервер";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Сервер", Сервер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВДЗ = РезультатЗапроса.Выбрать();
	
	Пока ВДЗ.Следующий() Цикл
		
		Если 			ВДЗ.Параметр = Перечисления.ПараметрыСерверов_ат.УведомлятьОбОтсутствииСвязи 								тогда
			ОНедоступностиСервера 			= Истина;
		ИначеЕсли 	ВДЗ.Параметр = Перечисления.ПараметрыСерверов_ат.УведомлятьОПредельнойЗагрузкеПроцессора					тогда
			ОВысокойНагрузкеCPU				= Истина;
		ИначеЕсли 	ВДЗ.Параметр = Перечисления.ПараметрыСерверов_ат.УведомлятьОПредельнойЗагрузкеПамяти						тогда
			ОВысокойНагруженностиПамяти 	= Истина;
		ИначеЕсли 	ВДЗ.Параметр = Перечисления.ПараметрыСерверов_ат.УведомлятьОПороговомЗаполненииДисковойПодсистемы		тогда
			ОВысокомНаполненииHDD			= Истина;
		ИначеЕсли 	ВДЗ.Параметр = Перечисления.ПараметрыСерверов_ат.УведомлятьОКритическойЗагрузкеПроцессора				тогда
			ОКритическойНагруженностиCPU 	= Истина;
		ИначеЕсли 	ВДЗ.Параметр = Перечисления.ПараметрыСерверов_ат.УведомлятьОКритическойЗагрузкеПамяти						тогда
			ОКритическойЗагруженностиПамяти= Истина;
		ИначеЕсли 	ВДЗ.Параметр = Перечисления.ПараметрыСерверов_ат.УведомлятьОКритическомЗаполненииДискокойПодсистемы	тогда
			ОКритическомЗаполненииHDD  		= Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаСервере
Процедура СохранитьИЗакрытьНаСервере()
	
	НаборЗаписей = РегистрыСведений.СписокУведомляемыхОСтатусахСерверов_ат.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Сервер.Установить(Сервер);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если ОНедоступностиСервера = истина тогда
		ОСН 						= НаборЗаписей.Добавить();
	    ОСН.Пользователь	= Пользователь;
		ОСН.Сервер			= Сервер;
		ОСН.Параметр			= Перечисления.ПараметрыСерверов_ат.УведомлятьОбОтсутствииСвязи;
	КонецЕсли;
	
	Если ОВысокойНагрузкеCPU = истина тогда
		ВНП 						= НаборЗаписей.Добавить();
	    ВНП.Пользователь	= Пользователь;
		ВНП.Сервер			= Сервер;
		ВНП.Параметр			= Перечисления.ПараметрыСерверов_ат.УведомлятьОПредельнойЗагрузкеПроцессора
	КонецЕсли;
	
	Если ОВысокойНагруженностиПамяти = истина тогда
		ВНМ 						= НаборЗаписей.Добавить();
	    ВНМ.Пользователь	= Пользователь;
		ВНМ.Сервер			= Сервер;
		ВНМ.Параметр			= Перечисления.ПараметрыСерверов_ат.УведомлятьОПредельнойЗагрузкеПамяти;
	КонецЕсли;
	
	Если ОВысокомНаполненииHDD = истина тогда
		ВНД 						= НаборЗаписей.Добавить();
	    ВНД.Пользователь	= Пользователь;
		ВНД.Сервер			= Сервер;
		ВНД.Параметр			= Перечисления.ПараметрыСерверов_ат.УведомлятьОПороговомЗаполненииДисковойПодсистемы	КонецЕсли;
	
	Если ОКритическойНагруженностиCPU = истина тогда
		КНП 						= НаборЗаписей.Добавить();
	    КНП.Пользователь	= Пользователь;
		КНП.Сервер			= Сервер;
		КНП.Параметр			= Перечисления.ПараметрыСерверов_ат.УведомлятьОКритическойЗагрузкеПроцессора;
	КонецЕсли;
	
	Если ОКритическойЗагруженностиПамяти = истина тогда
		КНМ 						= НаборЗаписей.Добавить();
	    КНМ.Пользователь	= Пользователь;
		КНМ.Сервер			= Сервер;
		КНМ.Параметр			= Перечисления.ПараметрыСерверов_ат.УведомлятьОКритическойЗагрузкеПамяти;
	КонецЕсли;
	
	Если ОКритическомЗаполненииHDD = истина тогда
		КНД 						= НаборЗаписей.Добавить();
	    КНД.Пользователь	= Пользователь;
		КНД.Сервер			= Сервер;
		КНД.Параметр			= Перечисления.ПараметрыСерверов_ат.УведомлятьОКритическомЗаполненииДискокойПодсистемы;
	КонецЕсли;
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
//	СохранитьИЗакрытьНаСервере();
СписокПараметровПользователя= Новый Структура ;
СписокПараметровПользователя.Вставить("Уведомляемый", Пользователь);
СписокПараметровПользователя.Вставить("УведомлятьОбОтсутствииСвязи", ОНедоступностиСервера);
СписокПараметровПользователя.Вставить("УведомлятьОПредельнойЗагрузкеПроцессора", ОВысокойНагрузкеCPU);
СписокПараметровПользователя.Вставить("УведомлятьОПредельнойЗагрузкеПамяти", ОВысокойНагруженностиПамяти);
СписокПараметровПользователя.Вставить("УведомлятьОПороговомЗаполненииДисковойПодсистемы", ОВысокомНаполненииHDD);
СписокПараметровПользователя.Вставить("УведомлятьОКритическойЗагрузкеПроцессора", ОКритическойНагруженностиCPU);
СписокПараметровПользователя.Вставить("УведомлятьОКритическойЗагрузкеПамяти", ОКритическойЗагруженностиПамяти);
СписокПараметровПользователя.Вставить("УведомлятьОКритическомЗаполненииДискокойПодсистемы", ОКритическомЗаполненииHDD);


//Оповестить("ОбновитьСписокУведомляемых");
	Закрыть(СписокПараметровПользователя);
КонецПроцедуры
